pmo-dataset/mermaid/22.mmd
graph LR
	classDef endEvent stroke-width:4px
	
	StartMessageEvent_1(("probable recourse\ndetected")) --> Task_1["check case"]
	Task_1 --> ExclusiveGateway_1{"recourse possible?"}
	ExclusiveGateway_1 -->|"yes"| Task_2["send request for\npayment"]
	ExclusiveGateway_1 -->|"no"| Task_3["close case"]
	Task_3 --> EndNoneEvent_1(("case closed")):::endEvent
	Task_2 --> Task_4["send reminder"]
	Task_4 --> EventBasedGateway_1{"E"}
	EventBasedGateway_1 --> IntermediateMessageEventCatching_1(("disagreement letter\nreceived"))
	IntermediateMessageEventCatching_1 --> Task_5["check reasoning"]
	Task_5 --> ExclusiveGateway_2{"OK?"}
	ExclusiveGateway_2 -->|"yes"| Task_6["close case"]
	Task_6 --> EndNoneEvent_2(("case closed")):::endEvent
	EventBasedGateway_1 --> IntermediateTimerEvent_1(("Reminder is due"))
	IntermediateTimerEvent_1 --> Task_7["hand over to\ncollection agency"]
	ExclusiveGateway_2 -->|"no"| Task_7
	Task_7 --> EndNoneEvent_3(("case open")):::endEvent
	EventBasedGateway_1 --> IntermediateMessageEventCatching_2(("Money received"))
	IntermediateMessageEventCatching_2 --> Task_8["make booking"]
	Task_8 --> Task_9["close case"]
	Task_9 --> EndNoneEvent_4(("case closed")):::endEvent

	subgraph Pool_1 ["Recourse Clerk"]
	  Task_1
	  Task_2
	  Task_3
	  Task_4
	  Task_5
	  Task_6
	  Task_7
	  Task_8
	  Task_9
	  StartMessageEvent_1
	  EndNoneEvent_1
	  EndNoneEvent_2
	  EndNoneEvent_3
	  EndNoneEvent_4
	  IntermediateMessageEventCatching_1
	  IntermediateTimerEvent_1
	  IntermediateMessageEventCatching_2
	  ExclusiveGateway_1
	  ExclusiveGateway_2
	  EventBasedGateway_1
	end
