pmo-dataset/variations/graphviz_with_ids/22.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Task_1" [label="check case"];
  "Task_2" [label="send request for\npayment"];
  "Task_3" [label="close case"];
  "Task_4" [label="send reminder"];
  "Task_5" [label="check reasoning"];
  "Task_6" [label="close case"];
  "Task_7" [label="hand over to\ncollection agency"];
  "Task_8" [label="make booking"];
  "Task_9" [label="close case"];
  "StartMessageEvent_1" [shape=circle, label="probable recourse\ndetected"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="case closed"];
  "EndNoneEvent_2" [shape=circle, penwidth=4, label="case closed"];
  "EndNoneEvent_3" [shape=circle, penwidth=4, label="case open"];
  "EndNoneEvent_4" [shape=circle, penwidth=4, label="case closed"];
  "IntermediateMessageEventCatching_1" [shape=doublecircle, label="disagreement letter\nreceived"];
  "IntermediateTimerEvent_1" [shape=doublecircle, label="Reminder is due"];
  "IntermediateMessageEventCatching_2" [shape=doublecircle, label="Money received"];
  "ExclusiveGateway_1" [shape=diamond, label="recourse possible?"];
  "ExclusiveGateway_2" [shape=diamond, label="OK?"];
  "EventBasedGateway_1" [shape=diamond, label="E"];

  "StartMessageEvent_1" -> "Task_1";
  "Task_1" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "Task_2" [label="yes"];
  "ExclusiveGateway_1" -> "Task_3" [label="no"];
  "Task_3" -> "EndNoneEvent_1";
  "Task_2" -> "Task_4";
  "Task_4" -> "EventBasedGateway_1";
  "EventBasedGateway_1" -> "IntermediateMessageEventCatching_1";
  "IntermediateMessageEventCatching_1" -> "Task_5";
  "Task_5" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "Task_6" [label="yes"];
  "Task_6" -> "EndNoneEvent_2";
  "EventBasedGateway_1" -> "IntermediateTimerEvent_1";
  "IntermediateTimerEvent_1" -> "Task_7";
  "ExclusiveGateway_2" -> "Task_7" [label="no"];
  "Task_7" -> "EndNoneEvent_3";
  "EventBasedGateway_1" -> "IntermediateMessageEventCatching_2";
  "IntermediateMessageEventCatching_2" -> "Task_8";
  "Task_8" -> "Task_9";
  "Task_9" -> "EndNoneEvent_4";

  subgraph "cluster_Pool_1" {
    label="Recourse Clerk";
      "Task_1";
      "Task_2";
      "Task_3";
      "Task_4";
      "Task_5";
      "Task_6";
      "Task_7";
      "Task_8";
      "Task_9";
      "StartMessageEvent_1";
      "EndNoneEvent_1";
      "EndNoneEvent_2";
      "EndNoneEvent_3";
      "EndNoneEvent_4";
      "IntermediateMessageEventCatching_1";
      "IntermediateTimerEvent_1";
      "IntermediateMessageEventCatching_2";
      "ExclusiveGateway_1";
      "ExclusiveGateway_2";
      "EventBasedGateway_1";
  }
}
